TestCases/rotatingObjectTest/Main/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "5e-05/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wall
    {
        type            wall;
        physicalType    patch;
        nFaces          92;
        startFace       1946;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          19;
        startFace       2038;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          9;
        startFace       2057;
    }
    defaultFaces
    {
        type            empty;
        nFaces          2744;
        startFace       2066;
    }
    overset
    {
        type            overset;
        physicalType    patch;
        nFaces          62;
        startFace       4810;
    }
    object
    {
        type            wall;
        physicalType    patch;
        nFaces          42;
        startFace       4872;
    }
)

// ************************************************************************* //
