TestCases/rotatingObjectTest/Main/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    object
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

	inlet
    {
        type            uniformFixedValue;
        uniformValue    (-0.5 -2 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }

    overset
    {
        type            overset;
    }
}


// ************************************************************************* //
